In [1]:
%load_ext sql
%sql mysql+pymysql://root:@localhost:3307/csv_data

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Pratice on IPL DataSet<br><br>Find the top 5 Batsman of Highest Runs in IPL</div>

In [24]:
%%sql 
SELECT batter,COUNT(*) AS runs FROM ipl
GROUP BY batter 
ORDER BY runs DESC
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[('V Kohli', 5266),
 ('S Dhawan', 5083),
 ('RG Sharma', 4632),
 ('DA Warner', 4313),
 ('SK Raina', 4177)]


<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find the 2nd highest 6 hitter in IPL</div>

In [29]:
%%sql 
SELECT batter, SUM(batsman_run) AS total_sixes FROM ipl
GROUP BY batter
ORDER BY total_sixes DESC
LIMIT 1,1

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[('S Dhawan', Decimal('6244'))]


<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find Virat Kohli's Most Runs against Bowler
</div>

In [38]:
%%sql
SELECT bowler, SUM(batsman_run) AS runs FROM ipl WHERE batter = 'V Kohli'
GROUP BY batter,bowler
ORDER BY runs DESC
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[('R Ashwin', Decimal('160'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find top 10 batsman with centuries in ipl</div>

In [46]:
%%sql
SELECT batter,SUM(batsman_run) AS runs FROM ipl
GROUP BY batter,ID HAVING runs > 100
ORDER BY runs DESC
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/csv_data
10 rows affected.

[('CH Gayle', Decimal('175')),
 ('BB McCullum', Decimal('158')),
 ('Q de Kock', Decimal('140')),
 ('AB de Villiers', Decimal('133')),
 ('KL Rahul', Decimal('132')),
 ('AB de Villiers', Decimal('129')),
 ('RR Pant', Decimal('128')),
 ('CH Gayle', Decimal('128')),
 ('M Vijay', Decimal('127')),
 ('DA Warner', Decimal('126'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find the top 5 batsman with highest strike rate who have played a minimum of 1000 balls</div>

In [85]:
%%sql
SELECT batter,COUNT(batsman_run) AS balls, SUM(batsman_run) AS runs,
ROUND((SUM(batsman_run) / COUNT(batsman_run) * 100),2) AS strike FROM ipl
GROUP BY batter HAVING balls >= 1000 
ORDER BY strike DESC
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[('AD Russell', 1212, Decimal('2039'), Decimal('168.23')),
 ('V Sehwag', 1833, Decimal('2728'), Decimal('148.83')),
 ('AB de Villiers', 3487, Decimal('5181'), Decimal('148.58')),
 ('GJ Maxwell', 1571, Decimal('2320'), Decimal('147.68')),
 ('JC Buttler', 1955, Decimal('2832'), Decimal('144.86'))]

<hr>
<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Pratice on Sleep Efficiency Data Set<br><br>Find out the average sleep duration of top 15 male candidates who's sleep duration are equal to 7.5 or greater than 7.5.</div>

In [127]:
%%sql

SELECT 
ROUND(AVG(`Sleep duration`),4) AS 'avg'
FROM sleep WHERE Gender = "Male" AND `Sleep duration` >= 7.5
ORDER BY `Sleep duration` DESC

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(8.0159,)]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Show avg deep sleep time for both gender.<br>Round result at 2 decimal places.<br>Note: sleep time and deep sleep percentage will give you, deep sleep time</div>

In [154]:
%%sql
SELECT GENDER,ROUND(AVG(`Sleep duration` * (`Deep sleep percentage`/100)),2) AS "avg"
FROM sleep
GROUP BY Gender

 * mysql+pymysql://root:***@localhost:3307/csv_data
2 rows affected.

[('Female', 3.87), ('Male', 4.01)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find out the lowest 10th to 30th light sleep percentage records where deep sleep percentage values are between 25 to 45.<br>Display age, light sleep percentage and deep sleep percentage columns only
</div>

In [190]:
%%sql

SELECT age,`Light sleep percentage`,`Deep sleep percentage` 
FROM sleep WHERE `Deep sleep percentage` BETWEEN 25 AND 45 
ORDER BY `Deep sleep percentage` DESC
LIMIT 10,30

 * mysql+pymysql://root:***@localhost:3307/csv_data
30 rows affected.

[(41, 45, 35),
 (42, 47, 35),
 (65, 45, 35),
 (23, 45, 35),
 (10, 47, 35),
 (27, 40, 35),
 (27, 45, 35),
 (23, 45, 35),
 (25, 45, 35),
 (32, 45, 35),
 (55, 45, 35),
 (9, 47, 35),
 (16, 47, 35),
 (40, 45, 35),
 (62, 45, 35),
 (44, 45, 35),
 (58, 47, 35),
 (56, 45, 35),
 (15, 45, 35),
 (30, 45, 35),
 (39, 47, 35),
 (44, 48, 32),
 (65, 48, 32),
 (24, 48, 32),
 (36, 48, 32),
 (37, 48, 32),
 (40, 48, 32),
 (18, 48, 30),
 (53, 52, 30),
 (33, 50, 30)]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Group by on exercise frequency and smoking status and show average deep sleep time, average light sleep time and avg rem sleep time<br>Note the differences in deep sleep time for smoking and non smoking status
</div>

In [207]:
%%sql
SELECT 
`Smoking status`,

ROUND(AVG(`Sleep duration` * (`Deep sleep percentage`)/100),2) AS 'avg_deep_sleep',
ROUND(AVG(`Sleep duration` * (`Light sleep percentage`)/100),2) AS 'avg_light_sleep',
ROUND(AVG(`Sleep duration` * (`REM sleep percentage`)/100),2) AS 'avg_rem_sleep'

FROM sleep

GROUP BY `Exercise frequency`,`Smoking status`
ORDER BY avg_deep_sleep DESC

 * mysql+pymysql://root:***@localhost:3307/csv_data
14 rows affected.

[('No', 5.49, 1.24, 1.52),
 ('No', 4.44, 1.41, 1.41),
 ('No', 4.35, 1.28, 1.6),
 ('No', 4.32, 1.46, 1.8),
 ('No', 4.24, 1.51, 1.68),
 ('No', 3.97, 1.63, 1.78),
 ('Yes', 3.89, 1.67, 1.67),
 ('No', 3.74, 2.17, 1.65),
 ('Yes', 3.68, 2.03, 1.79),
 ('Yes', 3.58, 2.18, 1.68),
 ('Yes', 3.37, 2.64, 1.69),
 ('Yes', 3.26, 2.24, 1.5),
 ('Yes', 2.45, 3.15, 1.4),
 ('Yes', 1.76, 5.04, 1.2)]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Group By on Awekning and show AVG Caffeine consumption, AVG Deep sleep time and AVG Alcohol consumption only for people who do exercise atleast 3 days a week. Show result in descending order awekenings</div>

In [227]:
%%sql

SELECT `Awakenings`,
ROUND(AVG(`Caffeine consumption`),2) AS 'avg_caffeine',
ROUND(AVG(`Sleep duration` * (`Deep sleep percentage`)/100),2) AS 'avg_deep_sleep',
ROUND(AVG(`Alcohol consumption`),2) AS 'avg_alchole'


FROM sleep WHERE `Exercise frequency` >= 3.0
GROUP BY `Awakenings`
ORDER BY `Awakenings` DESC

-- LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/csv_data
6 rows affected.

[(4.0, 7.35, 3.57, 1.31),
 (3.0, 3.12, 3.41, 1.82),
 (2.0, 8.33, 3.74, 1.33),
 (1.0, 14.49, 4.2, 1.29),
 (0.0, 27.22, 4.42, 0.58),
 (None, 27.27, 4.17, 1.82)]

<hr>
<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Pratice on  power generator data<br><br>
<ul>Display those power stations which have average 'Monitored Cap.(MW)' </ul>
<ul>(display the values) between 1000 and 2000 and the number of occurance of the power stations </ul>
<ul>(also display these values) are greater than 200.</ul>
<ul>Also sort the result in ascending order.</ul>
</div>

In [241]:
%%sql
SELECT COUNT(`Power Station`) AS "occurence",
`Power Station`,
AVG(`Monitored Cap.(MW)`) AS "avg_Moniter_cap"
FROM power 
GROUP BY `Power Station` HAVING avg_Moniter_cap BETWEEN 1000 AND 2000 AND occurence > 200
ORDER BY avg_Moniter_cap DESC
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/csv_data
10 rows affected.

[(1859, 'RGPPL', 1989.5285314685725),
 (1864, 'TSPL', 1980.0),
 (1859, 'PPGCL (Jaypee)', 1980.0),
 (1865, 'LPGCL', 1980.0),
 (1865, 'TOR. POW. (UNOSUGEN)', 1968.2426273458445),
 (1865, 'SJVNL', 1912.0200000000168),
 (5577, 'NHPC', 1805.3506903353011),
 (1885, 'Himachal Pradesh', 1802.715649867374),
 (1850, 'RATTANINDIA', 1711.2162162162163),
 (3724, 'NLC', 1694.6294307196563)]

<hr>
<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Practice on Avg Cost of Undergrad College by State(USA) Dataset<br><br>
Display top 10 lowest \"value\" State names of which the Year either belong to 
<ul>2013 or 2017 or 2021 and type is 'Public In-State'</ul>
<ul>Also the number of occurance should be between 6 to 10.</ul>
<ul>Display the average value upto 2 decimal places, state names and the occurance of the states
</ul>
</div>

In [16]:
%%sql

SELECT State,ROUND(AVG(`Value`),2) AS "avg_value",
COUNT(*) AS occurence
FROM nces WHERE Year IN (2013,2017,2021) AND Type = 'Public In-State'
GROUP BY State HAVING occurence BETWEEN 6 AND 10
ORDER BY avg_value ASC

LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/csv_data
10 rows affected.

[('New Mexico', Decimal('5403.50'), 8),
 ('Utah', Decimal('5565.50'), 8),
 ('Wyoming', Decimal('5753.25'), 8),
 ('Idaho', Decimal('5805.38'), 8),
 ('Florida', Decimal('5940.38'), 8),
 ('Oklahoma', Decimal('6088.00'), 8),
 ('North Carolina', Decimal('6103.00'), 8),
 ('Montana', Decimal('6158.13'), 8),
 ('Mississippi', Decimal('6200.38'), 8),
 ('Arkansas', Decimal('6239.00'), 8)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Best state in terms of low education cost (Tution Fees) in 'Public' type university.
</div>

In [44]:
%%sql

SELECT *,AVG(Value) AS "avg_value" 
FROM nces WHERE Type LIKE "%Public%" AND Expense LIKE "%Tuition%"
GROUP BY State
ORDER BY avg_value ASC
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(2013, 'Wyoming', 'Public In-State', '2-year', 'Fees/Tuition', 2420, Decimal('7089.8571'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">2nd Costliest state for Private education in year 2021. <br>Consider, Tution and Room fee both.
</div>

In [65]:
%%sql

SELECT *,AVG(Value) AS "avg_value" FROM nces WHERE Type LIKE "%Private%" AND Year = 2021
GROUP BY State
ORDER BY avg_value DESC
LIMIT 1,1

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(2021, 'Vermont', 'Private', '4-year', 'Fees/Tuition', 48300, Decimal('31685.5000'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Pratice on shipping-ecommerce Dataset<br><br>Display total and average values of Discount_offered for all the combinations of 'Mode_of_Shipment' (display this feature) and 'Warehouse_block' (display this feature also) for all male ('M') and 'High' Product_importance.<br>Also sort the values in descending order of Mode_of_Shipment and ascending order of Warehouse_block.
</div>

In [84]:
%%sql

SELECT Discount_offered,Mode_of_Shipment,Warehouse_block,

AVG(Discount_offered) AS "disscount_avg",
SUM(Discount_offered) AS "disscount"

FROM shipping WHERE Gender = "M" AND Product_importance = "high"
GROUP BY Warehouse_block,Mode_of_Shipment
ORDER BY Mode_of_Shipment DESC, Warehouse_block ASC

 * mysql+pymysql://root:***@localhost:3307/csv_data
15 rows affected.

[(6, 'Ship', 'A', Decimal('16.0233'), Decimal('689')),
 (25, 'Ship', 'B', Decimal('18.2558'), Decimal('785')),
 (34, 'Ship', 'C', Decimal('11.3469'), Decimal('556')),
 (5, 'Ship', 'D', Decimal('12.3443'), Decimal('753')),
 (3, 'Ship', 'F', Decimal('15.0500'), Decimal('1505')),
 (47, 'Road', 'A', Decimal('18.6000'), Decimal('279')),
 (1, 'Road', 'B', Decimal('11.8333'), Decimal('142')),
 (5, 'Road', 'C', Decimal('9.8571'), Decimal('138')),
 (50, 'Road', 'D', Decimal('18.7778'), Decimal('338')),
 (52, 'Road', 'F', Decimal('13.4615'), Decimal('350')),
 (5, 'Flight', 'A', Decimal('17.1250'), Decimal('274')),
 (4, 'Flight', 'B', Decimal('18.5000'), Decimal('222')),
 (34, 'Flight', 'C', Decimal('10.0000'), Decimal('190')),
 (5, 'Flight', 'D', Decimal('8.0000'), Decimal('112')),
 (35, 'Flight', 'F', Decimal('16.1944'), Decimal('583'))]